using Tyuiu.GolubevDS.Sprint2.Task7.V4.Lib;
DataService ds = new DataService();

Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* Спринт #2                                                                                                  *");
Console.WriteLine("* Тема: Получение результата из switch                                                                       *");
Console.WriteLine("* Задание #6                                                                                                 *");
Console.WriteLine("* Вариант #13                                                                                                *");
Console.WriteLine("* Выполнил: Голубев Дмитрий Сергеевич  | ИБКСб-24-1                                                          *");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                                   *");
Console.WriteLine("* Написать программу, которая использует сокращенный оператор switch и вычисляет требуемое значение и        *");
Console.WriteLine("* возвращает результат.                                                                                      *");
Console.WriteLine("* Условие: Дата некоторого дня характеризуется тремя натуральными числами: g(год), m(месяц), n(день)         *");
Console.WriteLine("* По заданным g, n и m определить дату следующего дня. Заданный год является високосным.                     *");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                           *");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("Введите значение Х ");
double x = Convert.ToDouble(Console.ReadLine());

Console.WriteLine("Введите значение Y");
double y = Convert.ToDouble(Console.ReadLine());

Console.WriteLine("***************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
Console.WriteLine("***************************************************************************");

Console.WriteLine(ds.CheckDotInShadedArea(x, y));

Console.ReadKey();